[
	 {
			"title": "Interstellar Reporter Danica Star",
      "StoryURL": "DaniStar",

      "Chapters": [
      { "Chapter":"Chapter I", "URL":"I", "title": "Tell Me You Got That Shot?", "description": "The story of an unpopular reporter whose found the story of a lifetime.", "text": 
        
        "Danica taps away at a machine trying to squeeze truth out of complex electronics like sap from a giant maple, but not any sort of absolute truth. She seeks the inner truth felt by all sentient beings of a given demographic, in a particular range of income, that would make the story easy to sell to the Networks. Each twitch of her delicately manicured fingers, changes the footage scrolling by. The scene flickers in and out of focus, she tries toggles the three dimensional playback, centralized VR, holographic, then she stops. Her bored expression changing to one of sheer delight. She restarts the footage. “I’ve got it, get in here,” she commands while simultaneously checking her appearance in the reflection of a nearby black monitor. “I can’t,” Walter replies over the com. While the ship was not large, the back control room was so isolated that you could be going through a type 4 jump point and not even notice. “Get in here now Jellyfish!” She rewinds the footage, a young girl, dirty white clothes, bloody, dazed walks through a scene of devastation. Walter looks around at the surrounding space, the cockpit design gave a full view, thrust into the void, look straight up and you see stars, left, right, between your feet. The view in the ship was superb, but Walter didn’t like the idea of leaving the cockpit unless they were docked. He disengages the drives and tries to make his trajectory as neutral as possible, even though there probably wasn’t a ship for a million kilometers. The ship slides into a horizontal formation, bringing Walters cockpit seat alongside the one that was previously below. He pulls his way to the back of the ship in microgravity . He sees Danica still editing the footage, but frowns when he sees what she’s doing. “That won’t work.” “Of course it will, the framing is perfect.” “Framing? Framing, I got a pure multidimensional shot, with all subjects in the proper orientation and you cut it down to a window.” Walter throws up his arms. “Shut up Walter, I need you to open up a feed to the station, I want to upload this before we miss the news.” “Make the news?” “Yes, make the sector news and if possible all the way to Earth.” “Dani this is a long form, there is no way the network will pick it up.” “I’ve already made the adjustments, were going to go live here.” Danica turns and pulls down a computer station and powers it up. “I’ve seen the footage too Dani, I don’t think this is live material. Dead and missing refugees won’t sell.” “That’s not your problem.” Dani half listens to Walter as a holographic image appears from the system she powered up. The image appears to be the solar system. Walter pulls himself over to the transmitter station and fires it up, the antenna extends and he starts to see a connection finalizing the authorization. A warning appears, System Emergency channel given top priority, all other traffic will be limited. “We have a problem.” Danica types onto an alien looking keyboard that Walter hasn’t noticed before. “Dani, the EBS is shutting down local transmission, we’ll need to get to a jump point to send the data.” “Get in the pilot seat.” Dani says without looking up. Walter looks over and sees a red flashing spot on the holographic display. “What’s that?” “Get in the pilot seat now!” Walter kicks off from the floor and pulls himself back into the cockpit. As the system powers up he sees a new waypoint. “Warp us there as fast as you can.” “Okay, okay,” Walter climbs into the pilot seat frantically throwing switches. The back hatch snaps shut and the cockpit rotates to a horizontal layout. The hud flickers on showing a blip, he lines it up, and engages the Quantum drive. The ship warps slightly in the direction of travel, then snaps back. Walter lets out the breath he was holding, “We’ll be there in less than ten minutes.” “Dammit, it will all be over in ten, make sure the cameras are all ready to go.” “Yes, they all check out, all green and recording.” “Start recording now.” “Now?” Walter rolls his eyes. “Yes now Jellyfish and as soon as we’re out of warp get back here and establish an uplink.” “But I already told you…” “Do what I say and we might live through this.” Walter rolls his eyes and pulls up the cameras to double check the status. The ship comes out of Warp and Walter immediately begins dodging debris. He at first thinks he can simply slow his speed, but the debris field seems to be moving in all directions. The ship is struck multiple times, but takes no major damage. “I can’t fly through this.” “Follow this beacon.” Walter begins to follow the signal Dani sends him and within thirty seconds he sees the source. A damaged UEE fighter. “What the hell is a F8 Lightning doing here?” “This is Press vessel KTRK-40 Terra, we are responding to your distress call.” “Identify yourself, customs manifest.” Walter here’s a gruff voice over the com, the breakup was so bad he wouldn’t have guessed the fighter was so close. “Send it Jellyfish!” Dani barks over the com. “I was just getting to it.” He was about to ask why he should turn over his manifest, but did it anyway. “I don’t need help from you.” He hears the voice from the fighter reply after seeing Walters transmission. Walter looks around at the devastation, this is clearly a battlefield, and Walter had a feeling about this pilot not wanting help from them. He takes in a breath to reply and sputters when he sees the rear airlock open. He flips the wing camera around and sees Dani EVA’ing with an emergency grapple. She fires it before he can say anything. The shot manages to connect to the fighter. “God dammit Dani!” Walter yells as the ship lurches around from the winch pulling the fighter toward them and causing their ship to spin around. “I apologize, but my boss has other plans.” He says flipping the radio off and pulling the camera controls. He sets the fighter as a target and lets the computer handle the capture. He takes off his headset, the fighter pilots angry reply almost audible to him. He pulls himself to the back and puts on his helmet, checks his O2, and flips the headset over to the ship. “Jelly, goddammit respond when I call you.” “I was putting on my helmet, cameras are still up and running.” “They better be goddamit. Get a drone out and capture this debris field. I want as much footage as we can squeeze into these databanks” “That pilot is not very happy with you.” “The angrier the better.” Walter pulls the drone panel out and guides it to a good spot to his left. He taps the status, power, lens types, picks three, and launches them. He watches as they start to map and record the debris field. His mouth begins to drop when he sees what the field is made of and oddly find himself daydreaming about a hail storm he had witnessed as a child. That wasn’t hail. He turns toward the back of the ship, he could hear a series of rattling noises, something was hitting the ship. “Well maybe not that angry.” He hears Dani say over the com. “Jelly could you tell the fine officer that we in fact have no weapons on board.” Walter looks back at the command panel and sees another com channel blinking. He flips it on. “I will say again, I am commandeering this ship. If you have any weapons declare them now.” Walter looks around at the ship graveyard outside, the panels looked clear, and the drones still going. He opens the back hatch and sees a pilot holding a gun to Dani’s back. They were floating just at the entrance to the back hatch, which was still wide open. Walter holds up his hands and slowly lets his body turn in place. “I’m not armed.” “Are you happy now commander?” Dani says, her smirk clearly audible over the com. “I told you already I am not a commander, I am Lieutenant Bullard…” Bullard says with some frustration. Walter tries to place the accent, but he can’t quite nail it down. “We shouldn’t be exposing these instruments to a vacuum. We need to close the back hatch.” Bullard pushes Dani in and Walter quickly closes the hatch. The rear begins to pressurize. “So you’re not a commander, commander, so what outfit are you in?” Dani says in a soft silky voice. Walter rolls his eyes. She was like a bird of prey, that would attack in all conceivable ways until she achieved her objective. “I’m not allowed to divulge that information.” Bullard says. “Just making conversation baby. Jelly maybe we should get some food out. Are you hungry.” Dani takes off her helmet and let’s her hair rise up in the microgravity. Walter new this routine. Her hair was carefully prepared to not look like a matted mess in zero G and after Walter pulls off his own helmet he smells a sweet spring like scent. “Sure.” He smirks pulling himself over to the food bin. They really didn’t have anything to eat. If they were marooned for any reason they would easily starve in a week. He pulls out a few bars of something he didn’t bother to read and floats them to Bullard. Bullard was holding his helmet and looking around. He catches the bars, but doesn’t eat them. “So you’re reporters?” “I’m a reporter baby, Jelly is just a pilot camera boy.” This would normally cause Walter to call Dani a bitch, but he was far too distracted. “Is this a war zone.” Walter splutters out. A light starts flashing on a nearby panel. Walter reaches out and taps the warning, the message log shows active radar sweeping the area. He scrambles around, pulling himself into the front. Once in the cockpit he reaches to turn on the radar. A hand out of nowhere grabs his wrist and inch from touching the switch. Dani floats in behind him. “Whatever you do, don’t turn your radar on.” Walter looks at Bullard, his face was pale. He turns the pad so he can see it and carefully sets the radar to passive. The HUD shows a half a dozen radar pings off in the distance. Dani pushes off toward the back. Bullard looks around. “Do you have anything else transmitting?” He says this in a calm voice. Walter frantically starts turning systems off. He sees the drones capturing footage and leaves them in a passive state and tells one to monitor them from a distance. He powers the long range transmitter down, but luckily it was broadcasting a beam in the opposite direction. “Everythings off, Dani!” The cockpit goes dark except for a few panels. “Everythings off back here too.” She yells back. “So those radar sources.” Walter points to them, there were only three now, and they showed only as a drifting dot. “How do you know…” “That those are bad guys?” Bullard taps a setting on the pad, a radar frequency graph starts showing each source. “That is not a pattern you would see from any UEE craft. In fact, can you record this?” “No, I don’t think so, oh, wait.” Walter pulls out a recording device and attaches it to the screen. “This won’t give you data, but it will at least show you the image.” “Reduce your life support as much as possible.” Bullard says. Walter gets up and opens the life support panel and turns it down. “Our scrubbers can handle three of us for about a week.” Bullard laughs out loud. “I say our odds are ten to one we last the next minute.” “I’ll take that bet!” Dani’s chimes in. Bullard and Walter turn. A faint light lit Dani and the editing station. She had a small single monitor on and typing at full speed, the rat tat tat coming from a very odd keyboard. Bullard pulls himself to the back and Walter follows. There it was, this was Dani’s secret. The reason she would kick Walter out of the back. “Where did you get that?” Bullard says suddenly alarmed. Walter looks at the keys, they were not quite right for a human hand, but Dani had no issue. “What outfit are you with?” She stops and turns her head. Walter never once witnessed Dani seducing a man or woman. The only reason she would act this way for the story. It was always for the story. “I’m not going to tell you anything about my outfit.” Bullard acts as if he were being interrogated by the enemy. Dani to a lot of military personnel was the enemy. Walter felt relief that this soldier didn’t want to put a bullet in her head. “Oh she already knows.” Walter says seeing right through the sultry exterior Dani had on display. He just realized she took the top of her space suit off and wrapped it around her waist leaving a skimpy t-shirt on. Bullard wasn’t fazed and Walter was getting bored with this. “What do you mean she already knows?” “Wait.” Walter puts up his hand. “What is it Jelly?” Dani asks, but doesn’t want an answer, she’s already typing away. “We survived a minute.” He checks his watch. Bullard looks relieved. “Dani what in the hell is that language and why are you typing a novel all of the sudden.” Walter looks at the screen. The language looked like a mishmash of alien languages. “So what outfit am I from?” Bullard asks. “Well the only carrier in the system would be the old P1G. I hope that’s not what this field is made up of.” Bullard drifts forward and looks out the front. “No, I’m pretty sure they jumped out.” “Oh that’s not surprising, Conrad always turns tail when the fight is more than he can…” Dani stops when a loud clicking noise strike, a round being chambered into a rifle. Bullard pointing it at Dani. She stops typing and doesn’t move. “I should have killed you the moment I knew.” Bullard looks down the site at Dani. “Kill us now and you won’t have anyone to assist you.” “You think I need assistance from the likes of you?” Dani slowly turns with her hands up and looks at him. “You’re Lieutenant Jacques Bullard, first in your class from Terran Naval academy, 2940. You served on Essex stationed in Davien, and I’m guessing that’s when you met Conrad.” “Captain Rhadamanthys.” “He recruited you for his new assignment. He was to take a Pegasus class carrier and patrol the Nyx to Oberon stretch.” She taps a screen nearby and it turns on. “I got your distress call, coded, very difficult to detect and meant for military contact, not a reporter. I had your ship SID, I ran it and figured out who you were.” “You can get coded signals?” “I can get part of the message, SIDs and locations. Not the message itself.” Bullard looks around in amazement. An alarm from the front causes everyone to freeze. Walter moves to the front so fast he passes the pilot seat and hits the curved window. Bullard grasps onto a handrail by the hatch and reaches out to Walter, helping pull him to the seat. They didn’t need to read the alarm, they could see a large vessel approaching the debris. The claw like silhouette was unmistakably Vanduul, searchlights scan the field as it moves through. Arms periodically reaching out and pulling in debris. “We can’t let them do this.” Bullard says looking out the window. “We better hope they don’t find us as salvage.” “No you don’t understand. There are vital things in this field, things I need to salvage.” “You came alone? Didn’t you?” Dani says, again tapping away. Walter looks at the scanner, he didn’t see anything. “Lieutenant?” Walter says. Bullard comes over and checks the scanner settings. “Do you have any other scanning equipment on board?” Bullard asks. Walter shakes his head. “Oh I think I could be of assistance.” Walter and Bullard look back into the pitch black again. The same scene as before, Dani typing away with a smug look on her face. Walter figures if he shoots her they could figure things out together. She reaches over and turns something on. A black tentacle like appendage reaches out from under the console. Walter and Bullard react, Walter ducks off to the side, while Bullard aims his rifle again. “Oh come on Bullard, you knew there was something wrong with this ship the moment we found you.” The appendage has a interface at it’s tip, Dani starts to sort of massage it. A humming noise starts up. Walter and Bullard turn around to see a haze begin to surround the ship. “They won’t see us in this.” She floats into the cockpit. “Now Lieutenant, would you like to give me a story or not?” Bullard looks at her with a furrowed brow. Walter looks at Dani trying to read her actions. “If not. I would like you to leave my ship, I’ll give you some supplies and a power pack, and send you on your way.” Dani says matter of fact, while pulling her space suit back on. Walter feels sick, he wants to stop her, tell her no you can’t just throw someone out like that, but nothing comes out of his mouth. “Jellyfish, don’t just stand there. Get everything back online and the drones.” “You have drones?” Bullard asks trying to recover from Dani’s demands. “Camera, they’re on automatic mapping the area. I suspect one is following that ship.” He looks, but the haze blocks his view. “Well Lieutenant I really appreciate you stopping by, but we really must get back to work.” Dani heads for the terminal again and pulls the round keyboard up. “What do you want.” Bullard’s mumble hardly audible. “I’m sorry dear what was that.” She zips her suit up and reaches for her helmet. “What is it you want to know.” He says. Walter looks at Bullard floating lamely nearby, defeated. “Now, was that so hard to say?” Dani doesn’t break her typing stride. An alarm goes off in the front cabin. Walter looks at the alarm and reads. “Collision?” Suddenly out of the haze a mutli fingered metal arm swoops in and grasps the ship. A loud crunching sound comes from the top. “Dani get your goddamn helmet back on!” Walter yells into the back. He glances back seeing Dani reaching for her helmet, when the ship lurches. He’s slammed into the floor and almost knocked out. Sparks start to shoot out of every panel in the cockpit. Walter pulls himself toward the main panel, hits the emergency button and pulls the main breaker. The sparks cease, but it wasn’t soon enough to prevent all hatches and locks from opening. He grips the bottom of the pilot’s seat to prevent himself being pulled into space. After the whoosh of air, followed by silence broken only by his breathing, he looks into the back. Just then a light shines into the high visibility cockpit. He frantically pulls himself into the back and off to the side to prevent from being seen. He looks around to see Dani still typing away. Her helmet looks like it was barely on, but she managed not to be pulled out the back when the bay opened up. His eye’s were still adjusting, but he has a feeling that Bullard was no longer on the ship. He was in his spacesuit, a lot better one than Walter had, and he had space combat training. He was all right. Walter pulls himself over to Dani and tries to avoid being seen. They had no place to hide. He puts a hand on Dani’s shoulder. She was typing. He could hear the sound resonate through her suit into his. She doesn’t respond, but Walter knows better than to interrupt. “This is insane Dani. Is the story really more important than our lives.” He knows she can’t hear him and even if they were in a nice quiet room it wouldn’t matter. She would ignore him, but now she turns. He can barely make out her frightened face. He could see her hand on a long breaker arm. This was all her equipment connected to its own power source. Her features became clearer in the semi darkness and Walter could see the fear, but also a resolve. His mouth drops open looking back at the breaker. Walter takes a deep breath pushing back the swelling wave of sorrow. This meant their deaths. He gathers all of his strength and nods his head. He feels his hand being grasped by Dani. A sweet gesture, then he realizes she’s pulling his hand up to the breaker. Together they pull. The back of the ship springs to alive. Life unlike that of a human ship. There were organic tentacles pulsating with energy reaching to the top of the ship. One tentacle has a wire harness at the end and jabs itself into the array’s maintenance port. Now the ship is alive as well, powered by it’s distant organic cousin. Walter could see the transmitter sending a repeating burst communication. Dani was sending it all, unedited, no touch up, no makeup. He had no idea she was this brave. The ship moves wildly to port. Walter and Dani are thrown against the opposite bulkhead. He grabs onto Dani holding tight. They bounce into a cargo net that popped out of its cargo container and fall halfway out of the ship. Walter sees streaks of light cutting through the ship. The cargo net comes loose and they float away from the ship, helpless, watching the ship get torn apart by the giant Vanduul fang of a ship. The light goes out in the back and the transmission array floats off in pieces. He feels Dani grip his arm. He looks at her, then notices she’s pointing. She was yelling something, he hears her muffled voice through her hands gripping his suit. Was she panicking? No she was asking something. Where? Walter looks at their dead ship and toward the back he follows a cord that hangs limp in space connected to nothing. The Vanduul ship shines a spot on them. They see it closing on them. For a moment Walter thinks they are firing at them, but the rounds were coming from the wrong angle. A bright flash, and explosion, debris hitting them rattling against their spacesuits. The Vanduul ship flies away. Walter follows its progress then notices a pursuer. Too small to be a ship, it was one of their drones. Walter laughs out a tear. “Go you little bastard, someone is going to find the best combat footage ever!” He could tell it was hard to breath. The suit was starting to constrict against his body, it was cold, very cold. Dani’s grip on his arm was growing soft. He looks again for his drone. He finds it, still chasing the Vanduul ship. But there was something else. A bright light, it was a missile, and as the Vanduul ship tries to dodge he sees an explosion ripping through the Vanduul. The wounded ship spins for a few seconds then explodes in a spectacular display. “You got that you little piece of shit! You got that shot!” Walter passes out."
      
      },
      { "Chapter":"Chapter II", "URL":"II", "description": "", "text":"" },
      { "Chapter":"Chapter III", "URL":"III", "description": "", "text":""   },
      { "Chapter":"Chapter IV", "URL":"IV", "description": "", "text":""   },
      { "Chapter":"Chapter V", "URL":"V", "description": "", "text":""   }
    ]
  },
		{
			"title": "The Treachery of Patriots",
      "StoryURL": "SenatorTitus",
			"description": "An elderly Senator takes the podium and a stand against the corruption all around him."
		}
	]
